//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СебестоимостьИПремииОтсутствуют()","СебестоимостьИПремииОтсутствуют","Допустим себестоимость и премии отсутствуют");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюОбработку()","ЯОткрываюОбработку","Когда  я открываю обработку");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВыбираюПериод()","ВыбираюПериод","и выбираю период");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НажимаюНаКнопкуРассчитать()","НажимаюНаКнопкуРассчитать","и нажимаю на кнопку Рассчитать");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СебестоимосьИПремииРассчитались()","СебестоимосьИПремииРассчитались","Тогда  себестоимось и премии рассчитались");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим себестоимость и премии отсутствуют
//@СебестоимостьИПремииОтсутствуют()
Процедура СебестоимостьИПремииОтсутствуют() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда  я открываю обработку
//@ЯОткрываюОбработку()
Процедура ЯОткрываюОбработку() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и выбираю период
//@ВыбираюПериод()
Процедура ВыбираюПериод() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и нажимаю на кнопку Рассчитать
//@НажимаюНаКнопкуРассчитать()
Процедура НажимаюНаКнопкуРассчитать() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда  себестоимось и премии рассчитались
//@СебестоимосьИПремииРассчитались()
Процедура СебестоимосьИПремииРассчитались() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля